## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aks.azurerm_kubernetes_cluster.my-aks has been deleted
  - resource "azurerm_kubernetes_cluster" "my-aks" {
      - id                                  = "/subscriptions/567e3618-cfd3-4f2a-8596-a1754b09b3f5/resourceGroups/puru-rg/providers/Microsoft.ContainerService/managedClusters/puru-dev" -> null
        name                                = "puru-dev"
        tags                                = {
            "Environment" = "Dev"
        }
        # (35 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.rg.azurerm_resource_group.myrg has been deleted
  - resource "azurerm_resource_group" "myrg" {
        id         = "/subscriptions/567e3618-cfd3-4f2a-8596-a1754b09b3f5/resourceGroups/puru-rg"
      - location   = "eastus" -> null
      - name       = "puru-rg" -> null
        tags       = {
            "Created_By" = "Dev Team"
            "Env"        = "Develop"
            "Team"       = "Infra-Team"
        }
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.my-aks will be created
  + resource "azurerm_kubernetes_cluster" "my-aks" {
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "puru-cluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.33.1"
      + local_account_disabled              = true
      + location                            = "eastus"
      + name                                = "puru-dev"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = "puru-rg-nodepool"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "puru-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "Dev"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + azure_rbac_enabled = true
          + tenant_id          = (sensitive value)
        }

      + default_node_pool {
          + auto_scaling_enabled = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 3
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "defaultpool"
          + node_count           = (known after apply)
          + node_labels          = {
              + "environment"   = "dev"
              + "nodepool-type" = "system"
              + "nodepoolos"    = "linux"
            }
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + tags                 = {
              + "environment"   = "dev"
              + "nodepool-type" = "system"
              + "nodepoolos"    = "linux"
            }
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2s_v6"
          + workload_runtime     = (known after apply)
          + zones                = [
              + "1",
              + "2",
              + "3",
            ]
        }

      + kubelet_identity (known after apply)

      + network_profile {
          + dns_service_ip     = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + service_principal {
          + client_id     = (sensitive value)
          + client_secret = (sensitive value)
        }

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.linux-pool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "linux-pool" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 2
      + max_pods              = (known after apply)
      + min_count             = 1
      + mode                  = "User"
      + name                  = "linux102"
      + node_count            = (known after apply)
      + node_labels           = {
          + "environment"   = "Dev"
          + "nodepool-type" = "user"
          + "os-type"       = "linux"
        }
      + orchestrator_version  = "1.33.1"
      + os_disk_size_gb       = 30
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "environment"   = "Dev"
          + "nodepool-type" = "user"
          + "os-type"       = "linux"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D2s_v6"
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.rg.azurerm_resource_group.myrg will be created
  + resource "azurerm_resource_group" "myrg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "puru-rg"
      + tags     = {
          + "Created_By" = "Dev Team"
          + "Env"        = "Develop"
          + "Team"       = "Infra-Team"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>